#+TITLE: Rapport de TER appariement de questions/réponses
#+AUTHOR: Félix Jamet
#+OPTIONS: tags:nil
#+LATEX_HEADER: \newcommand{\norm}[1]{\left\lVert#1\right\rVert}
#+LATEX_HEADER: \newcommand{\var}[1]{{\operatorname{\mathit{#1}}}}
#+LATEX_HEADER: \let\oldtextbf\textbf
#+LATEX_HEADER: \renewcommand{\textbf}[1]{\textcolor{red}{\oldtextbf{#1}}}
#+PROPERTY: header-args:ipython :eval no-export :results output drawer replace :exports results
* noweb                                                            :noexport:
:PROPERTIES:
:header-args:ipython: tangle: no :eval never
:END:

#+NAME: traincorpus
#+BEGIN_SRC ipython
  corpora = {'train2016p1': 'SemEval2016-Task3-CQA-QL-train-part1.xml'}
#+END_SRC

#+NAME: bothyears
#+BEGIN_SRC ipython
  corpora = {'2016': 'SemEval2016-Task3-CQA-QL-test-input.xml',
             '2017': 'SemEval2017-task3-English-test-input.xml',}

  relevancy = {'2016': 'scorer/SemEval2016-Task3-CQA-QL-test.xml.subtaskB.relevancy',
               '2017': 'scorer/SemEval2017-Task3-CQA-QL-test.xml.subtaskB.relevancy'}
#+END_SRC

#+NAME: scoreutils
#+BEGIN_SRC ipython
  import subprocess
  from plasem_algostruct import transformtree

  def compute_relqs_scores(orgqnode, scorer):
      return {relid: scorer(orgqnode['org'], orgqnode[relid])
              for relid in orgqnode.keys() - {'org'}}

  def make_score_tree(document_tree, scorer):
      return transformtree(
          lambda x: compute_relqs_scores(x, scorer),
          document_tree,
          0
      )

  def getmapscore(predfilename):
      score = subprocess.run(
          ['./extractMAP.sh', predfilename], stdout=subprocess.PIPE)
      return score.stdout.decode('utf-8').strip('\n')

  from collections import Iterable
  def flatten(*args):
      for el in args:
          if isinstance(el, Iterable) and not isinstance(el, (str, bytes)):
              yield from flatten(*el)
          else:
              yield el

  def getpredfilename(*args):
      return 'predictions/rapport_' + '_'.join(flatten(args, 'scores.pred'))

  def orgmodetable(matrix, header=False):
      maxlen = [0] * len(matrix[0])
      for line in matrix:
          for i, cell in enumerate(line):
              if len(maxlen) <= i or len(str(cell)) > maxlen[i]:
                  maxlen[i] = len(str(cell))

      def orgmodeline(line, fill=' '):
          joinsep = fill + '|' + fill
          return '|' + fill + joinsep.join(
              str(cell) + fill * (mlen - len(str(cell)))
              for cell, mlen in zip(line, maxlen)
          ) + fill + '|'

      result = ''
      if header:
          result = orgmodeline(matrix[0]) + '\n' + \
              orgmodeline(('-') * len(maxlen), fill='-') + '\n'
          matrix = matrix[1:]
      result += '\n'.join(orgmodeline(line) for line in matrix)
      return result

#+END_SRC

#+NAME: loaddoctrees
#+BEGIN_SRC ipython
  import spacy
  from plasem_taln import inverse_document_frequencies
  from plasem_semeval import make_or_load_semeval_document_tree
  from semeval_xml import get_semeval_content

  nlp = spacy.load('en')
  doctrees = {
      corpus: make_or_load_semeval_document_tree(
          corpusxml,
          'spacy_en_' + corpus + '_questions.pickle',
          nlp,
          get_semeval_content)
      for corpus, corpusxml in corpora.items()
  }

  training_file = 'SemEval2016-Task3-CQA-QL-train-part1.xml'
  traindoctree = make_or_load_semeval_document_tree(
      training_file,
      'spacy_en_train2016p1_questions.pickle',
      nlp,
      get_semeval_content)

  inversedocfreqs = inverse_document_frequencies(
      [[str(tok) for tok in doc]
       for org in traindoctree.values()
       for doc in org.values()]
  )
  outofcorpusvalue = max(inversedocfreqs.values())

  context = {'inversedocfreqs': inversedocfreqs,
             'outofcorpusvalue': outofcorpusvalue}
#+END_SRC

#+NAME: scoringboilerplate
#+BEGIN_SRC ipython :noweb yes
  <<scoreutils>>

  <<loaddoctrees>>
 
  <<filters>>

  restable = []
#+END_SRC

#+NAME: makescores
#+BEGIN_SRC ipython
  from plasem_semeval import write_scores_to_file
  from plasem_taln import comparator

  comp = comparator(context, similarity)
  scores = make_score_tree(
      doctrees[corpus],
      comp.getscore
  )
#+END_SRC

#+NAME: writescores
#+BEGIN_SRC ipython
  predfile = getpredfilename(methodname, corpus, *rest)
  write_scores_to_file(scores, predfile)
#+END_SRC

#+NAME: debugmap
#+BEGIN_SRC ipython
  descr = ', '.join(flatten(corpus, rest))
  print('MAP%s:' % descr, MAP_from_semeval_relevancy(relevancy[corpus], scores))
#+END_SRC

#+NAME: MAP_from_relevancy
#+BEGIN_SRC ipython
  from plasem_semeval import MAP_from_semeval_relevancy
  restable.append([*(description_functions[i](value)
                     for i, value in enumerate((corpus, *rest))),
                   '%.2f' % (100 * MAP_from_semeval_relevancy(relevancy[corpus], scores))])
#+END_SRC

#+NAME: MAP_from_xml
#+BEGIN_SRC ipython
  from plasem_semeval import MAP_from_semeval_xml
  restable.append([*(description_functions[i](value)
                     for i, value in enumerate((corpus, *rest))),
                   '%.2f' % (100 * MAP_from_semeval_xml(corpora[corpus], scores))])
#+END_SRC

#+NAME: restable_viaSH
#+BEGIN_SRC ipython
  restable = [[*(description_functions[i](parameter_values[i])
                 for i in range(0,len(parameter_values))),
               getmapscore(getpredfilename(methodname, *parameter_values))]
              for parameter_values in parameters]
#+END_SRC

#+NAME: print_sorted_restable
#+BEGIN_SRC ipython
  restable.sort(key=lambda x: x[-1], reverse=True)
  restable.sort(key=lambda x: x[0])
  restable.insert(0, parameters_description)

  print('#+NAME:', methodname)
  print('#+CAPTION:', caption)
  print(orgmodetable(restable, header=True))
  print()
#+END_SRC

** Filtres
#+NAME: filters
#+BEGIN_SRC ipython
  MAPPSENT_STOPWORDS = set(open('stopwords_en.txt', 'r').read().splitlines())

  def isnotstopword(word):
      return word not in MAPPSENT_STOPWORDS

  lenfilters = {
      'gtr1': lambda word: len(word) > 1,
      'gtr2': lambda word: len(word) > 2,
      'gtr3': lambda word: len(word) > 3,
      'gtr4': lambda word: len(word) > 4,
  }

  nolenfilters = {
      'nostopwords': isnotstopword,
  }

  filters = {}
  filters.update(lenfilters)
  filters.update(nolenfilters)
  filters.update({ 'nofilter': lambda x: True })

  all_filters_descr = {
      'gtr1': '$\leq 1$',
      'gtr2': '$\leq 2$',
      'gtr3': '$\leq 3$',
      'gtr4': '$\leq 4$',
      'nostopwords': 'Mots outils',
      'nofilter': 'Pas de filtre',
  }

  all_indicators_descr = {
      'named_entities_text': 'Textes des entités nommées',
      'named_entities_label': 'Étiquettes des entités nommées',
      'tokens': 'Tokens',
      'lemmas': 'Lemmes',
  }

  def get_filters_descr(filters):
      return ', '.join(all_filters_descr[key] for key in filters)

  def get_indicator_descr(indicator):
      return all_indicators_descr[indicator]

  def get_doctree_descr(doctree):
      return all_doctrees_descr[doctree]

  from itertools import combinations
  def nonemptypartitions(iterable):
      for i in range(1, len(iterable) + 1):
          for perm in combinations(iterable, i):
              yield perm


  def join_predicates(iterable_preds):
      def joinedlocal(element):
          for pred in iterable_preds:
              if not pred(element):
                  return False
          return True
      print('joining', *(pred for pred in iterable_preds))
      return joinedlocal


  filters_partition = list(nonemptypartitions(nolenfilters))

  for len_and_nolen in product(nolenfilters, lenfilters):
      filters_partition.append(len_and_nolen)

  for lenfilter in lenfilters:
      filters_partition.append((lenfilter,))

  filters_partition.append(('nofilter',))
#+END_SRC

* Scripts                                                          :noexport:
#+BEGIN_SRC  ipython :eval no-export :noweb yes :session ponderation :tangle ponderation.py :shebang "#!/usr/bin/env python3" :results output drawer replace
  from itertools import product, count
  <<traincorpus>>
  <<scoringboilerplate>>

  from plasem_taln import generic_weights_scorer, noun_weighter

  methodname = 'noun_ponderation'
  caption = 'Semeval - Scores MAP - Méthodes de référence'

  def frange(start, end=None, inc=1.0):
      if end is None:
          end = start + 0.0 # Ensure a float value for 'end'
          start = 0.0
      for i in count():
          next = start + i * inc
          if (inc>0.0 and next>=end) or (inc<0.0 and next<=end):
              break
          yield next

  ponderations = list(frange(0, 10, 0.05))

  parameters = list(product(corpora, ponderations))
  parameters_description = ('Édition', 'Ponderation', 'Score MAP')
  description_functions = [lambda x: x, str]

  for corpus, *rest in parameters:
      def noun_weight_similarity(context, reference, candidate):
          return generic_weights_scorer(context,
                                        reference,
                                        candidate,
                                        [(rest[0], noun_weighter)])
      similarity = noun_weight_similarity
      context['filters'] = [filters['gtr2']]
      context['wordex'] = lambda x: str(x).lower()

      <<makescores>>
      <<MAP_from_xml>>

  <<print_sorted_restable>>
#+END_SRC

#+RESULTS:
:RESULTS:
#+NAME: noun_ponderation
#+CAPTION: Semeval - Scores MAP - Méthodes de référence
| Édition     | Ponderation         | Score MAP |
|-------------|---------------------|-----------|
| train2016p1 | 0.35000000000000003 | 28.31     |
| train2016p1 | 0.5                 | 28.08     |
| train2016p1 | 0.30000000000000004 | 28.01     |
| train2016p1 | 0.45                | 27.94     |
| train2016p1 | 0.55                | 27.88     |
| train2016p1 | 0.4                 | 27.87     |
| train2016p1 | 0.6000000000000001  | 27.74     |
| train2016p1 | 0.25                | 27.52     |
| train2016p1 | 0.65                | 27.28     |
| train2016p1 | 0.7000000000000001  | 27.14     |
| train2016p1 | 0.2                 | 26.94     |
| train2016p1 | 0.75                | 26.51     |
| train2016p1 | 0.15000000000000002 | 26.28     |
| train2016p1 | 0.1                 | 25.97     |
| train2016p1 | 0.8                 | 25.86     |
| train2016p1 | 0.9                 | 25.51     |
| train2016p1 | 0.8500000000000001  | 25.47     |
| train2016p1 | 0.9500000000000001  | 25.39     |
| train2016p1 | 0.05                | 25.29     |
| train2016p1 | 0.0                 | 24.72     |
| train2016p1 | 1.0                 | 24.60     |
| train2016p1 | 1.05                | 23.46     |
| train2016p1 | 1.1                 | 22.44     |
| train2016p1 | 1.1500000000000001  | 22.24     |
| train2016p1 | 1.2000000000000002  | 21.62     |
| train2016p1 | 1.3                 | 21.18     |
| train2016p1 | 1.25                | 21.17     |
| train2016p1 | 1.35                | 21.09     |
| train2016p1 | 1.4000000000000001  | 20.95     |
| train2016p1 | 1.4500000000000002  | 20.56     |
| train2016p1 | 1.5                 | 20.45     |
| train2016p1 | 1.75                | 20.32     |
| train2016p1 | 1.55                | 20.31     |
| train2016p1 | 1.8                 | 20.27     |
| train2016p1 | 1.6                 | 20.25     |
| train2016p1 | 1.6500000000000001  | 20.23     |
| train2016p1 | 1.85                | 20.16     |
| train2016p1 | 1.7000000000000002  | 20.15     |
| train2016p1 | 1.9000000000000001  | 20.11     |
| train2016p1 | 2.0                 | 20.02     |
| train2016p1 | 1.9500000000000002  | 20.01     |
| train2016p1 | 2.0500000000000003  | 19.77     |
| train2016p1 | 2.1                 | 19.74     |
| train2016p1 | 2.15                | 19.72     |
| train2016p1 | 2.2                 | 19.55     |
| train2016p1 | 2.25                | 19.45     |
| train2016p1 | 2.3000000000000003  | 19.44     |
| train2016p1 | 2.4000000000000004  | 19.43     |
| train2016p1 | 2.35                | 19.41     |
| train2016p1 | 2.45                | 19.28     |
| train2016p1 | 2.5                 | 19.27     |
| train2016p1 | 2.5500000000000003  | 19.27     |
| train2016p1 | 2.6                 | 19.00     |
| train2016p1 | 2.6500000000000004  | 18.78     |
| train2016p1 | 2.7                 | 18.78     |
| train2016p1 | 2.75                | 18.78     |
| train2016p1 | 3.0500000000000003  | 18.78     |
| train2016p1 | 3.1                 | 18.77     |
| train2016p1 | 3.1500000000000004  | 18.77     |
| train2016p1 | 2.8000000000000003  | 18.74     |
| train2016p1 | 3.0                 | 18.71     |
| train2016p1 | 2.85                | 18.70     |
| train2016p1 | 2.9000000000000004  | 18.70     |
| train2016p1 | 3.2                 | 18.68     |
| train2016p1 | 3.25                | 18.66     |
| train2016p1 | 3.4000000000000004  | 18.65     |
| train2016p1 | 3.3000000000000003  | 18.64     |
| train2016p1 | 3.35                | 18.64     |
| train2016p1 | 2.95                | 18.63     |
| train2016p1 | 3.85                | 18.62     |
| train2016p1 | 3.9000000000000004  | 18.62     |
| train2016p1 | 3.95                | 18.62     |
| train2016p1 | 4.0                 | 18.62     |
| train2016p1 | 3.6                 | 18.61     |
| train2016p1 | 3.6500000000000004  | 18.61     |
| train2016p1 | 3.45                | 18.60     |
| train2016p1 | 3.5                 | 18.60     |
| train2016p1 | 3.5500000000000003  | 18.60     |
| train2016p1 | 3.7                 | 18.60     |
| train2016p1 | 3.75                | 18.60     |
| train2016p1 | 3.8000000000000003  | 18.60     |
| train2016p1 | 4.05                | 18.59     |
| train2016p1 | 4.1000000000000005  | 18.50     |
| train2016p1 | 4.15                | 18.47     |
| train2016p1 | 4.2                 | 18.47     |
| train2016p1 | 4.25                | 18.43     |
| train2016p1 | 4.3                 | 18.43     |
| train2016p1 | 4.3500000000000005  | 18.35     |
| train2016p1 | 4.4                 | 18.35     |
| train2016p1 | 4.45                | 18.35     |
| train2016p1 | 4.5                 | 18.34     |
| train2016p1 | 4.55                | 18.34     |
| train2016p1 | 4.6000000000000005  | 18.34     |
| train2016p1 | 4.65                | 18.34     |
| train2016p1 | 4.7                 | 18.33     |
| train2016p1 | 4.75                | 18.33     |
| train2016p1 | 4.800000000000001   | 18.33     |
| train2016p1 | 4.8500000000000005  | 18.33     |
| train2016p1 | 4.9                 | 18.33     |
| train2016p1 | 4.95                | 18.31     |
| train2016p1 | 5.0                 | 18.31     |
| train2016p1 | 5.050000000000001   | 18.31     |
| train2016p1 | 5.1000000000000005  | 18.31     |
| train2016p1 | 5.15                | 18.31     |
| train2016p1 | 5.2                 | 18.31     |
| train2016p1 | 5.25                | 18.31     |
| train2016p1 | 5.300000000000001   | 18.31     |
| train2016p1 | 5.3500000000000005  | 18.31     |
| train2016p1 | 5.4                 | 18.30     |
| train2016p1 | 5.45                | 18.30     |
| train2016p1 | 5.5                 | 18.30     |
| train2016p1 | 5.6000000000000005  | 18.29     |
| train2016p1 | 5.65                | 18.29     |
| train2016p1 | 5.7                 | 18.29     |
| train2016p1 | 5.75                | 18.29     |
| train2016p1 | 5.800000000000001   | 18.29     |
| train2016p1 | 5.8500000000000005  | 18.29     |
| train2016p1 | 5.9                 | 18.29     |
| train2016p1 | 5.95                | 18.29     |
| train2016p1 | 6.0                 | 18.29     |
| train2016p1 | 6.050000000000001   | 18.28     |
| train2016p1 | 6.1000000000000005  | 18.28     |
| train2016p1 | 6.15                | 18.26     |
| train2016p1 | 6.2                 | 18.26     |
| train2016p1 | 6.25                | 18.26     |
| train2016p1 | 6.300000000000001   | 18.26     |
| train2016p1 | 6.3500000000000005  | 18.26     |
| train2016p1 | 5.550000000000001   | 18.24     |
| train2016p1 | 6.4                 | 18.24     |
| train2016p1 | 6.45                | 18.20     |
| train2016p1 | 6.5                 | 18.20     |
| train2016p1 | 6.550000000000001   | 18.20     |
| train2016p1 | 6.6000000000000005  | 18.19     |
| train2016p1 | 6.65                | 18.19     |
| train2016p1 | 6.7                 | 18.19     |
| train2016p1 | 6.75                | 18.19     |
| train2016p1 | 7.4                 | 18.13     |
| train2016p1 | 7.45                | 18.13     |
| train2016p1 | 6.800000000000001   | 18.11     |
| train2016p1 | 6.8500000000000005  | 18.11     |
| train2016p1 | 6.9                 | 18.11     |
| train2016p1 | 6.95                | 18.11     |
| train2016p1 | 7.0                 | 18.11     |
| train2016p1 | 7.050000000000001   | 18.11     |
| train2016p1 | 7.1000000000000005  | 18.11     |
| train2016p1 | 7.15                | 18.11     |
| train2016p1 | 7.2                 | 18.11     |
| train2016p1 | 7.25                | 18.11     |
| train2016p1 | 7.300000000000001   | 18.09     |
| train2016p1 | 7.3500000000000005  | 18.05     |
| train2016p1 | 7.5                 | 18.04     |
| train2016p1 | 7.550000000000001   | 18.04     |
| train2016p1 | 7.6000000000000005  | 18.04     |
| train2016p1 | 7.65                | 18.04     |
| train2016p1 | 7.7                 | 18.04     |
| train2016p1 | 7.75                | 18.04     |
| train2016p1 | 7.800000000000001   | 18.04     |
| train2016p1 | 7.8500000000000005  | 18.04     |
| train2016p1 | 7.9                 | 18.04     |
| train2016p1 | 7.95                | 18.04     |
| train2016p1 | 8.0                 | 18.04     |
| train2016p1 | 8.05                | 18.03     |
| train2016p1 | 8.1                 | 18.03     |
| train2016p1 | 8.15                | 18.03     |
| train2016p1 | 8.200000000000001   | 18.03     |
| train2016p1 | 8.25                | 18.03     |
| train2016p1 | 8.3                 | 18.02     |
| train2016p1 | 8.35                | 18.02     |
| train2016p1 | 8.4                 | 17.93     |
| train2016p1 | 8.450000000000001   | 17.93     |
| train2016p1 | 8.5                 | 17.93     |
| train2016p1 | 8.55                | 17.93     |
| train2016p1 | 8.6                 | 17.93     |
| train2016p1 | 8.65                | 17.93     |
| train2016p1 | 8.700000000000001   | 17.93     |
| train2016p1 | 8.75                | 17.93     |
| train2016p1 | 8.8                 | 17.93     |
| train2016p1 | 8.85                | 17.93     |
| train2016p1 | 8.9                 | 17.93     |
| train2016p1 | 8.950000000000001   | 17.93     |
| train2016p1 | 9.0                 | 17.93     |
| train2016p1 | 9.05                | 17.92     |
| train2016p1 | 9.1                 | 17.92     |
| train2016p1 | 9.15                | 17.92     |
| train2016p1 | 9.200000000000001   | 17.92     |
| train2016p1 | 9.25                | 17.88     |
| train2016p1 | 9.3                 | 17.88     |
| train2016p1 | 9.35                | 17.88     |
| train2016p1 | 9.4                 | 17.88     |
| train2016p1 | 9.450000000000001   | 17.88     |
| train2016p1 | 9.5                 | 17.86     |
| train2016p1 | 9.55                | 17.77     |
| train2016p1 | 9.600000000000001   | 17.77     |
| train2016p1 | 9.65                | 17.73     |
| train2016p1 | 9.700000000000001   | 17.73     |
| train2016p1 | 9.75                | 17.73     |
| train2016p1 | 9.8                 | 17.73     |
| train2016p1 | 9.850000000000001   | 17.73     |
| train2016p1 | 9.9                 | 17.73     |
| train2016p1 | 9.950000000000001   | 17.73     |

:END:


* Présentation du sujet
Avec la démocratisation d'Internet, les communautés de questions/réponses telles que StackExchange, AskUbuntu ou Quora ont proliféré, produisant ainsi une masse conséquente d'informations.

Il est paradoxalement difficile de trouver la réponse idéale à une question parmi une telle quantité d'informations. C'est ce problème qui est investigué depuis 2015 dans le cadre de la tâche 3 de SemEval[fn:semevaltask3].

[fn:semevaltask3] Voir http://alt.qcri.org/semeval2017/task3/.


SemEval est un /WorkShop/ ayant pour but d'évaluer des approches d'interprétation automatique de la sémantique du langage naturel.
La tâche 3 est concernée par l'appariement questions/réponses, autrement dit, étant donné une question, trouver la ou les meilleures réponses y correspondant.

La sous-tâche B de la tâche 3 de SemEval consiste à faire de l'appariement question/question, c'est à dire étant donné deux questions, déterminer elles sont similaires.
C'est cette sous-tâche qui est traitée dans ce TER.

Les méthodes proposées par les participants des éditions 2016 et 2017 de SemEval pour résoudre cette étape sont des techniques d'apprentissage automatique allant du SVM au /deep learning/. *(pas sûr ; le rapport de semeval 2016 stipule de (Franco-Salvador et al., 2016) que "They use distributed representations of words, knowledge graphs generated with BabelNet, and frames from FrameNet.", j'ai pas l'impression que c'est du /machine learning/)*

Ce TER a pour but de regarder l'efficacité que pourrait avoir une approche plus simple, d'avantage ancrée dans la linguistique computationnelle que dans l'apprentissage automatique.
Pour cela, trois objectifs sont distingués :
 - Réfléchir à la manière de détecter des questions similaires en termes de caractéristiques linguistiques.(d'indicateurs et de marqueurs linguistiques.)
 - Mettre en oeuvre une méthode pour les détecter automatiquement.
 - Travailler sur une évaluation de l'approche proposée.

* SemEval - Tâche 3 - Similarité question/question
Afin de comparer différentes approches, SemEval fournit des données d'entrainement, de développement et de test, ainsi qu'un /scorer/ permettant d'associer un score à une approche.

Les données proviennent des forums de /Qatar Living/, un site centré autour d'une communauté d'expatriés vivant au Qatar.
Ces données sont organisées sous forme de documents XML contenant $N$ questions dites originales.
À chaque question originale sont associées 10 questions reliées, et à chaque question reliée sont associés 10 commentaires.

Dans le cadre de la sous-tâche B, il est demandé à une approche d'ordonner les questions reliées selon leur pertinence par rapport à la question originale.
Le /scorer/ utilise cet ordre prédit pour évaluer une approche, en utilisant l'indicateur MAP (/Mean Average Precision/).
La MAP d'une liste de prédiction reflète non seulement l'exactitude des prédictions mais également à quel point l'ordre des prédictions est correct.

* Méthodes proposées
Plusieurs méthodes sont envisagées. Il a été choisi de mesurer leur efficacité individuellement dans un premier temps, puis de chercher des manières pour les combiner les unes avec les autres.

Le problème est abordé comme un problème de /scoring/. Il s'agit de donner un score de similarité entre une question reliée et sa question originale. L'ordre des questions est établi en triant les questions dans l'ordre décroissant selon leur score de similarité.

Les méthodes proposées utilisent des sacs de mots. Une approche à base de sacs de mots consiste à représenter un document en utilisant un multi-ensemble de mots (un multi-ensemble est un ensemble pouvant contenir plusieurs occurences d'un même élément).
Une conséquence de cette approche est que l'ordre des mots est ignoré.

Un autre point commun des méthodes envisagées est qu'elles ont toutes recours au TF-IDF pour pondérer les mots selon leur fréquence.
La TF (/Term Frequency/) d'un mot correspond à sa fréquence d'apparition dans l'ensemble des documents.
L'IDF (/Inverse Document Frequency/) d'un mot est proportionnelle à l'inverse du nombre de documents dans lesquels il apparaît.
La TF-IDF d'un mot présent dans le corpus correspond à une combinaison de sa TF et de son IDF.
Si un mot est absent du corpus, sa TF-IDF est égale à l'IDF du terme le plus rare. *pas sûr que ça soit la bonne manière de faire*
Plus formellement,

\[TF(terme, document) = \frac{occurences(terme, document)}{taille(document)}\]
\[IDF(terme, corpus) = log \left( \frac{taille(corpus)}
{\norm{\{doc / doc \in corpus \land terme \in doc\}}} \right)\]
\[\var{TF-IDF}(terme, document, corpus) =
\begin{cases}
TF(terme, document) \times IDF(terme, corpus) & \text{si } terme \in corpus \\
\min(\{IDF(el, corpus) / el \in corpus\}) & \text{sinon}
\end{cases}\]

Les méthodes sont testées sur les données de test des années 2016 et 2017 de la tâche 3 de SemEval et sont entrainées sur les données d'entrainement fournies pour ces années.

** Mise au point d'une méthode de référence
La méthode de référence que nous proposons consiste à travailler avec l'intersection des sacs de mots des questions à comparer. Le score de similarité est établi comme la somme des valeurs TF-IDF des sacs de mots. Les valeurs TF-IDF sont calculées en utilisant comme corpus le texte de toutes les questions originales et reliées extraites des données d'entrainement et comme document les deux questions mises bout à bout.

\[similarit\acute{e}_{r\acute{e}f\acute{e}rence}(Q_1, Q_2) =
\sum_{terme \in Q_1 \cap Q_2} \var{TF-IDF}(terme, Q_1 \cup Q_2, texte_{entrainement})\]

La table [[baseline]] indique les scores MAP de la méthode de référence sur les éditions 2016 et 2017 de SemEval. La table [[best_scores]] montre les meilleurs scores MAP des éditions 2016 et 2017 de SemEval, ainsi que les scores de la IR (/Information Retrieval/) /baseline/, correspondant à conserver l'ordre initialement proposé par le moteur de recherche lors de la constitution des jeux de données.

#+BEGIN_SRC ipython :eval no-export :noweb yes :session baselineexec :tangle rapport_baseline.py :shebang "#!/usr/bin/env python3" :results output drawer replace
  from itertools import product
  <<bothyears>>
  <<scoringboilerplate>>

  from plasem_taln import baseline_similarity
  similarity = baseline_similarity

  methodname = 'baseline'
  caption = 'Semeval - Scores MAP - Méthode de référence'

  parameters = list(product(corpora))
  parameters_description = ('Édition', 'Score MAP')
  description_functions = [lambda x: x]

  for corpus, *rest in parameters:
      <<makescores>>
      <<writescores>>
      <<MAP_from_relevancy>>

  <<print_sorted_restable>>
#+END_SRC

#+RESULTS:
:RESULTS:
#+NAME: baseline
#+CAPTION: Semeval - Scores MAP - Méthode de référence
| Édition | Score MAP |
|---------|-----------|
| 2016    | 71.48     |
| 2017    | 44.21     |

:END:

#+NAME: best_scores
#+ATTR_LATEX: :placement [p]
#+CAPTION: SemEval - Meilleurs scores MAP
| Édition | Méthode               | Score MAP  |
|---------+-----------------------+------------|
|    2016 | UH-PRHLT-contrastive2 |      77.33 |
|    2016 | UH-PRHLT-primary      |      76.70 |
|    2016 | UH-PRHLT-contrastive1 |      76.56 |
|    2016 | IR /baseline/         |      74.75 |
|    2017 | KeLP-contrastive1     |      49.00 |
|    2017 | SimBow-contrastive2   |      47.87 |
|    2017 | SimBow-primary        |      47.22 |
|    2017 | IR /baseline/         |      41.85 |


** Filtres


#+BEGIN_SRC ipython :eval no-export :noweb yes :session baselinefiltersexec :tangle rapport_baseline_filters.py :shebang "#!/usr/bin/env python3" :results output drawer replace
  from itertools import product
  <<bothyears>>
  <<scoringboilerplate>>

  from plasem_taln import filters_baseline_similarity
  similarity = filters_baseline_similarity

  methodname = 'baseline_filters'
  caption = 'Semeval - Scores MAP - Méthodes de référence'

  parameters = list(product(corpora, filters_partition))
  parameters_description = ('Édition', 'Filtres', 'Score MAP')
  description_functions = [lambda x: x, get_filters_descr]
  for corpus, *rest in parameters:
      context['filters'] = [filters[key] for key in rest[0]]
      <<makescores>>
      <<writescores>>
      <<MAP_from_relevancy>>

  <<print_sorted_restable>>
#+END_SRC

#+RESULTS:
:RESULTS:
#+NAME: baseline_filters
#+CAPTION: Semeval - Scores MAP - Méthodes de référence
| Édition | Filtres               | Score MAP |
|---------|-----------------------|-----------|
| 2016    | Mots outils, $\leq 1$ | 75.42     |
| 2016    | Mots outils, $\leq 2$ | 75.04     |
| 2016    | $\leq 1$              | 74.58     |
| 2016    | $\leq 3$              | 74.42     |
| 2016    | Mots outils, $\leq 4$ | 74.21     |
| 2016    | $\leq 4$              | 74.06     |
| 2016    | Mots outils, $\leq 3$ | 73.97     |
| 2016    | $\leq 2$              | 73.87     |
| 2016    | Mots outils           | 73.76     |
| 2016    | Pas de filtre         | 73.19     |
| 2017    | $\leq 1$              | 46.89     |
| 2017    | Mots outils, $\leq 1$ | 46.35     |
| 2017    | Mots outils, $\leq 2$ | 46.08     |
| 2017    | $\leq 2$              | 46.07     |
| 2017    | $\leq 3$              | 45.59     |
| 2017    | Pas de filtre         | 45.56     |
| 2017    | Mots outils           | 45.53     |
| 2017    | Mots outils, $\leq 3$ | 45.46     |
| 2017    | Mots outils, $\leq 4$ | 41.80     |
| 2017    | $\leq 4$              | 40.47     |

:END:


** Lemmatisation
* Indicateurs envisagés
** Nature grammaticale des mots
Identifier la nature grammaticale d'un mot peut donner un indice sur sa pertinence.
Une hypothèse vraisemblable est qu'un nom participera davantage au sens d'une phrase, tandis qu'un adjectif aura moins d'impact.
La nature d'un mot peut être détectée à l'aide d'étiqueteurs morpho-syntaxiques.

** Reconnaissance d'entité nommées
Une entité nommée est un mot ou groupe de mots designant une entité du monde.
La reconnaissance d'entités nommées est une technique permettant de detecter ces entités et de les classifier.

Les classes de ces entité comprennent des noms d'individus, des produits, des villes, ou encore des entreprises.

La reconnaissance d'entités nommées est intéressante pour la problématique de ce TER car beaucoup de questions portent sur des entités nommées.


*** Multi-ensembles d'entités nommées
Étant donné une phrase $s$, on peut créer plusieurs multi-ensembles à partir de ses entités nommées :
 - $CAT_s$, le multi-ensemble contenant les catégories des entités nommées de la phrase $s$.
 - $TOK_s$, le multi-ensemble contenant les tokens des entités nommées de la phrase $s$.

En prenant $s = \text{"Google and Apple headquarters are in California"}$, on a
$CAT_s = \{\text{ORG}, \text{ORG}, \text{GPE}\}$ et $TOK_s = \{\text{Google}, \text{Apple}, \text{California}\}$


* Pré-traitements
L'étape de pré-traitement consiste à utiliser des techniques simples

** Mots-outils

** Filtres

** Majuscules

* Techniques de TALN (à incorporer au fur et à mesure de l'écriture)

** Racinisation (/stemming/) et lemmatisation
Le but des ces deux techniques est de modifier un mot (typiquement d'ôter des suffixes) afin d'en obtenir une forme simplifiée.
Cette forme simplifiée permet d'associer des mots dérivant d'une même racine.

La différence entre ces deux techniques se situe dans la forme simplifiée qu'elle permettent d'obtenir.
Un racinisateur permet de générer une racine (ou radical), qui est une forme artificielle, tandis qu'un lemmatisateur génère un lemme, correspondant à un terme d'usage.
Par exemple, le mot "chercher" pourra être racinisé en "cherch", mais sera lemmatisé en "cherche".

Cette technique a son utilité dans la tâche de modifier des textes afin de mieux pouvoir les comparer, car elle permet d'une part de donner une forme commune à des termes proches, les rendant ainsi directement comparable, et d'autre part de réduire la diversité linguistique tout en préservant la semantique.

* Perspectives

** Dictionnaire de synonymes (wordnet)

** Suppression de bruit
Signatures, nombres, "utilisation créative des signes de ponctuation", détection de fautes, obligations sociales et remerciements, abbréviations

** Vocabulaire spécifique
Comparer avec d'autres corpus (corpora ?) pour voir quels termes sont spécifiques à quatar living et réfléchir à comment traiter les termes spécifiques

** Forme interrogative
La forme interrogative est à priori simple à détecter en anglais et pourrait être un bon critère pour extraire les passages les plus importants.
